[
	{
		"id": 1,
		"name": "Arcane",
		"title": "React Music Streaming App",
		"url": "https://arcanestreaming.herokuapp.com/",
		"imageUrl": "/images/arcane.png",
		"action": "View",
		"shortDescription": "A music streaming application for enjoying indie music on web and mobile.",
		"description": "Arcane is a music streaming application that I am working on as the main developer. My friends came up with the idea and are working on the business side of things. I am building the webpage, server, and mobile apps for the business.<br />For the website, I am using ReactJS as the view, Redux for the store, and the Django REST Framework for the backend.<br />As I do not have a Macintosh on which to work, I am currently only developing the mobile application for Android using AndroidStudio and Java.<br />While this is still a work in progress, I have learned a great deal about web development because of this project.<br/ ><br />A majority of the current code was developed as part of my Senior Project in conjunction with my friend Tyler Scott. This teamwork was a great benefit to the development as well as in learning the value of paired programming."
	},
	{
		"id": 2,
		"name": "RPG Map",
		"title": "An exploration in WebSockets and Docker Containers",
		"url": "https://rpgmap.herokuapp.com",
		"imageUrl": "/images/rpgmap.png",
		"action": "Explore",
		"shortDescription": "An interactive RPG Map for visualizing a role play situtation.",
		"description": "RPG Map was an idea that my cousins and I came up with. I wanted to learn more about WebSockets, specifically socket-io, and Docker containers.<br /> The idea was to use Heroku to host the app, build it using a Docker container, and allow for live communication via WebSockets. I chose Python and Flask for the backend due to my familiarity with Python, but I wanted to explor other server frameworks, so I chose Flask because it seemed to have a good socket-io package.<br /><br />I learned a lot from this project. I don't think Python is the best for a docker container web server. Due to the need for packages, the size of the container gets larger and takes longer to spin up. I plan on redoing the backend in Go for a quicker startup."

	}
]
